blog/一个整型溢出的bug.html

<!doctype html>
<html lang="en-us">
  <head>
    <meta charset="utf-8">
    <title>robin2003 &mdash; Home</title>
    <meta name="description" content="">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <link rel="stylesheet" type="text/css" href="/media/css/main.css">
    <link rel="stylesheet" type="text/css" href="https://maxcdn.bootstrapcdn.com/font-awesome/4.6.3/css/font-awesome.min.css">
    <link rel="alternate" type="application/rss+xml" href="/blog/rss.xml">
  </head>
  <body>
    
      <div class="social">
        <div class="container">
          <ul class="badges">
            <li>
              <a href="mailto:xxpyb@126.com" alt="Email">
                <span class="fa fa-envelope-o"></span>EMail
              </a>
            </li>
            <li>
              <a href="https://github.com/robin2003" target="_blank" alt="Github">
                <span class="fa fa-github-alt"></span>Github
              </a>
            </li>
            <li>
              <a href="/blog/rss.xml" alt="RSS">
                <span class="fa fa-rss"></span>RSS
              </a>
            </li>
          </ul>

          <a href="/" alt="robin2003">
          </a>
        </div>
      </div>
    

    <div class="post">
      <div class="container">
        
  <!-- 一个整型溢出的bug -->
  
  <div class="title">
    <h1>一个整型溢出的bug</h1>
    <span class="pubdate">Dec 10, 2021</span>
  </div>

  
  <div class="content">
    
<div id="outline-container-一个整型溢出的bug" class="outline-2">
<h2 id="一个整型溢出的bug">一个整型溢出的bug</h2>
<div class="outline-text-2" id="text-一个整型溢出的bug">
</div>
<div id="outline-container-问题复原" class="outline-3">
<h3 id="问题复原">问题复原</h3>
<div class="outline-text-3">
<p>
最近在项目中发现一个很典型的整型溢出的bug，先讲讲问题经过。
</p>

<p>
在项目中，一个对象有个expiration的成员变量，目的是标记该对象是否有效，该成员变量声明如下：
</p>
<pre class="example">
unsigned long long mExpirationTime;
</pre>

<p>
项目中，为了过滤掉要在2分钟内变得无效的对象，于是就写了如下的逻辑：
</p>
<pre class="example">
...
for( int i = 0; i &lt; size(); i++)
{
...
    if( ( mExpirationTime - THRESHOLD_IN_SECOND ) &gt; mCurrentTime )
    {   
        printf("Has been marked as expiration, ignore it!\n");
        continue;
    }
...
}
...
</pre>
<p>
本意是过滤掉无效对象，但是当程序跑起来，发现没有被标记的对象依然也被过滤掉！
</p>

<p>
最后终于发现过滤逻辑有问题。
</p>

<p>
对于*mExpirationTime*,正常对象，初始值都是0，当程序在运行到上面代码段时候，由于0减去
一个正数THRESHOLD<sub>IN</sub><sub>SECOND就变成一个负值了</sub>，减法完成后的结果最终会转换成被减数相同
类型，由于被减数是无符号型，所以负值就overflow 成一个正值，最终导致if 条件成立，正常
对象被过滤掉。
</p>
</div>
</div>

<div id="outline-container-启示" class="outline-3">
<h3 id="启示">启示</h3>
<div class="outline-text-3">
<p>
在开发过程中，这种隐式数据转换场景非常多，出问题后，也往往很隐蔽，所以平时一定要格外小心。
</p>

<p>
能想到的可以避免的一些途径有：
</p>
<ol class="org-ol">
<li>开发阶段： 谨慎的使用无符号作为条件判断，充分考虑到overflow可能性；</li>
<li>code review阶段：要in mind这种数值类型，尤其是无符号类型，在作为判断条件时候，一定要
重点关注；</li>
<li>重视静态代码检查工具。很多静态代码监测工具都能够识别出这种潜在问题，很多项目code base比较大，
系统也比较复杂，因为历史原因，可能埋藏了很多这样的潜在问题，这种时候，静态代码检测工具就
有用武之地了。</li>
</ol>
</div>
</div>
</div>

  </div>

      </div>
    </div>
  </body>
</html>
